---
kind: method
id: M:Autodesk.Revit.DB.View.CanEnableTemporaryViewPropertiesMode
zh: 视图
source: html/547aec06-7601-340d-4de1-ccc7c3502a20.htm
---
# Autodesk.Revit.DB.View.CanEnableTemporaryViewPropertiesMode Method

**中文**: 视图

Indicates if Temporary View Properties mode can be applied for view in current state.

## Syntax (C#)
```csharp
public bool CanEnableTemporaryViewPropertiesMode()
```

## Returns
True if view can use Temporary View Properties mode in current state.